overset/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    overset1
    {
        type            overset;
        nFaces          672;
        startFace       180154;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          356;
        startFace       180826;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180668;
        startFace       181182;
    }
)

// ************************************************************************* //
