overset/system/forceCoeffs
forces
{
    type                forces;
    functionObjectLibs  ("libforces.so");
    outputControl       timeStep;
    outputInterval      1;
     
    patches             ( "airfoil.*" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
     
    CofR                (0.25 0 0);
     
    rhoInf              1000;
}
 
 
forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ( "libforces.so" );
    outputControl       timeStep;
    outputInterval      1;
 
    patches             ( "airfoil.*" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
     
    liftDir             (0 0 1);
    dragDir             (-1 0 0);
    CofR                (0.25 0 0);
    pitchAxis           (0 1 0);
     
    magUInf             2.00;
    rhoInf              1000;
    lRef                1;
    Aref                1;
}